---
type: RebarBendData
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 14
tags: [revit-api, class]
---

# RebarBendData

`Autodesk.Revit.DB.Structure.RebarBendData` · Revit 2024 · 14 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RebarBendData | — | `` |
| Constructor | RebarBendData | 2012 | `public RebarBendData ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | BarModelDiameter | 2012 | `public double BarModelDiameter { get ; set ; }` |
| Property | BarNominalDiameter | 2012 | `public double BarNominalDiameter { get ; set ; }` |
| Property | BendRadius | 2012 | `public double BendRadius { get ; set ; }` |
| Property | HookAngle0 | 2012 | `public int HookAngle0 { get ; set ; }` |
| Property | HookAngle1 | 2012 | `public int HookAngle1 { get ; set ; }` |
| Property | HookBendRadius | 2012 | `public double HookBendRadius { get ; set ; }` |
| Property | HookLength0 | 2012 | `public double HookLength0 { get ; set ; }` |
| Property | HookLength1 | 2012 | `public double HookLength1 { get ; set ; }` |
| Property | HookOrient0 | 2012 | `public RebarHookOrientation HookOrient0 { get ; set ; }` |
| Property | HookOrient1 | 2012 | `public RebarHookOrientation HookOrient1 { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |